emas/loadtest/emas-performance-report/raw_data/sp1/apache_bench_data/750cus/varnish_ab_test_750_1000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      750
Time taken for tests:   0.138 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      32552000 bytes
HTML transferred:       31966000 bytes
Requests per second:    7231.08 [#/sec] (mean)
Time per request:       103.719 [ms] (mean)
Time per request:       0.138 [ms] (mean, across all concurrent requests)
Transfer rate:          229869.14 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       17   21   2.2     21      26
Processing:    29   40   8.5     40      55
Waiting:        4   25  14.5     24      51
Total:         46   60   8.8     64      76

Percentage of the requests served within a certain time (ms)
  50%     64
  66%     66
  75%     67
  80%     70
  90%     72
  95%     72
  98%     73
  99%     74
 100%     76 (longest request)